app/views/posts/index.html.erb

SELECT `posts`.* FROM `posts`
---
            <p class="text-muted"><%= t('views.posts.index.no_records') %></p>
            <%= link_to t('views.posts.index.first_record'), new_post_path, class: "btn btn-primary" %>