app/controllers/notifications_controller.rb

  def mark_as_read
    @notification = current_user.notifications.find(params[:id])
    @notification.update(read: true)
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 3 AND `notifications`.`id` = 8 LIMIT 1
UPDATE `notifications` SET `notifications`.`read` = TRUE, `notifications`.`updated_at` = '2026-04-14 16:48:22.459771' WHERE `notifications`.`id` = 8

  def mark_all_as_read
    current_user.notifications.where(read: false).update_all(read: true)
---
UPDATE `notifications` SET `notifications`.`read` = TRUE WHERE `notifications`.`user_id` = 1 AND `notifications`.`read` = FALSE