app/controllers/notifications_controller.rb

  def index
    @notifications = current_user.notifications.order(created_at: :desc).page(params[:page]).per(10)
    @unread_ids = current_user.notifications.where(read: false).pluck(:id)
    current_user.notifications.where(id: @unread_ids).update_all(read: true) if @unread_ids.any?
---
SELECT COUNT(*) FROM `notifications` WHERE `notifications`.`user_id` = 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 4 ORDER BY `notifications`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT `notifications`.`id` FROM `notifications` WHERE `notifications`.`user_id` = 1 AND `notifications`.`read` = FALSE
SELECT 1 AS one FROM `notifications` WHERE `notifications`.`user_id` = 1 AND `notifications`.`read` = FALSE LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 3 AND `notifications`.`id` = 8 LIMIT 1
UPDATE `notifications` SET `notifications`.`read` = TRUE WHERE `notifications`.`user_id` = 4 AND `notifications`.`id` IN (1, 2, 3)