app/controllers/posts_controller.rb

INSERT INTO `posts` (`titulo`, `descricao`, `user_id`, `created_at`, `updated_at`) VALUES ('teste', '', 1, '2026-03-31 17:20:48.717139', '2026-03-31 17:20:48.717139')
INSERT INTO `posts` (`titulo`, `descricao`, `user_id`, `created_at`, `updated_at`) VALUES ('Justificar Ponto', 'Prezado(a)\n\nSolicitamos que seja feito a justificativa no sistema intranet \nna opção onde é mostrado a lista de registros de ponto tem uma opção Justificar Ponto Ausente,\ncaso tenha feito não deve ter nenhum problema na folha ou alguma penalidade, seu gestor imediato vai \nanalisar e justificar a marcação que consta como ausente, qualquer duvida deve-se criar um processo no sistema SEI \ne encaminhar para SEAD, informando o ocorrido e solicitando mais informações sobre orientação.\n\nAtenciosamente,', 3, '2026-03-09 17:23:14.730332', '2026-03-09 17:23:14.730332')
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
        format.html { redirect_to @post, notice: t("flash.posts.create.notice") }

UPDATE `posts` SET `posts`.`descricao` = 'fffdfdffff', `posts`.`updated_at` = '2026-03-31 17:40:13.285546' WHERE `posts`.`id` = 29
INSERT INTO `notifications` (`target_type`, `target_id`, `object_type`, `object_id`, `read`, `metadata`, `created_at`, `updated_at`, `user_id`, `message`) VALUES (NULL, NULL, NULL, NULL, FALSE, NULL, '2026-04-09 13:44:32.912186', '2026-04-09 13:44:32.912186', 2, 'O Admin alterou o seu post: \'ok\'.')
UPDATE `posts` SET `posts`.`descricao` = 'Prezado(a)\n\nSolicitamos que seja feito a justificativa no sistema intranet \nna opção onde é mostrado a lista de registros de ponto tem uma opção Justificar Ponto Ausente,\ncaso tenha feito não deve ter nenhum problema na folha ou alguma penalidade, seu gestor imediato vai \nanalisar e justificar a marcação que consta como ausente, qualquer duvida deve-se criar um processo no sistema SEI \ne encaminhar para SEAD, informando o ocorrido e solicitando mais informações sobre orientação.\n\nAtenciosamente.', `posts`.`updated_at` = '2026-03-09 17:26:17.956394' WHERE `posts`.`id` = 13
---
  def update
    respond_to do |format|
      if @post.update(post_params)
        if current_user.has_role?(:admin) && @post.user != current_user
          Notification.create!(user: @post.user, message: "O administrador alterou o seu post: '#{@post.titulo}'.")
        end
        format.html { redirect_to @post, notice: t("flash.posts.update.notice"), status: :see_other }

DELETE FROM `posts` WHERE `posts`.`id` = 15
INSERT INTO `notifications` (`user_id`, `message`, `read`, `created_at`, `updated_at`) VALUES (4, 'O administrador excluiu o seu post: \'TEST\'.', FALSE, '2026-03-31 19:10:24.049732', '2026-03-31 19:10:24.049732')
---
  def destroy
    owner = @post.user
    title = @post.titulo
    @post.destroy!

    if current_user.has_role?(:admin) && owner != current_user
      Notification.create!(user: owner, message: "O administrador excluiu o seu post: '#{title}'.")