app/controllers/users_controller.rb

UPDATE `users` SET `users`.`encrypted_password` = '$2a$12$dUbdeEQR83Zk0Un0vz5bHuseoMYr0BPlDJSuSgVzadqa/TK5Nv5g2', `users`.`updated_at` = '2026-03-31 17:41:35.541705' WHERE `users`.`id` = 2
---
  def update
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    if @user.update(user_params)